Revit 2016 API
FabricationHostedInfo Methods
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost
 Disconnects the part from the host.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PlaceOnHost
 Places the part on the specified host.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace